Revit 2024 API
BuiltInFailures.FamilyFailures.CannotAddParameterToFamily Property
 Parameter '[Parameter]' cannot be added to the family.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId CannotAddParameterToFamily { get; }
Visual Basic
Public Shared ReadOnly Property CannotAddParameterToFamily As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ CannotAddParameterToFamily {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.FamilyFailures Class
Autodesk.Revit.DB Namespace